Revit 2027 API
MacroManager.RemoveModule Method
 Removes a MacroModule.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveModule(
	MacroModule module
)
Public Sub RemoveModule (
	module As MacroModule
)
public:
void RemoveModule(
	MacroModule^ module
)
member RemoveModule :
        module : MacroModule -> unit
Parameters
module MacroModule
 The module will be removed.
Exceptions
Exception | Condition
ArgumentException |  The given module is not a member of this collection.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Thrown when the given module is a UI module.
See Also
Reference
MacroManager Class
Autodesk.Revit.DB.Macros Namespace